<HTML>
<HEAD>
    <meta name="keywords" content="Robot, Karol, Programmiersprache, Java Karol">
    <meta name="author" content="Ulli Freiberger">
    <link rel="stylesheet" type="text/css" href="karol.css">
    <title>Java Karol - Info</title>
</HEAD>

<BODY>
<table border=0 cellspacing=0 cellpadding=0 width=490>
    <tr>
        <td colspan=3><img src="imgs/top_jkarol.gif" width="490" height="60"></td>
    </tr>

    <tr>
        <td width=490 background="imgs/white.gif" align=left valign=top>
            <table cellspacing=5 cellpadding=2 border=0 width=490>
            <tr>
                <td>
                <b>Java Karol</b> ist eine konsequente Fortf&uuml;hrung von Robot Karol f&uuml;r die Programmentwicklung mit der
                Programmiersprache <b>Java</b>.<p>
                Hierbei finden dieselben Objekte wie bei Robot Karol Verwendung, so dass die Anwender sofort mit dem System
                vertraut sind. Die Programme werden jedoch jetzt in Java formuliert und nicht mehr in der speziellen Sprache
                Karol. War diese Sprache zum Einstieg in die Programmierung sehr hilfreich und unerl&auml;sslich, so stehen den
                Sch&uuml;lerinnen und Sch&uuml;lern im <b>fortgeschrittenen Informatikunterricht</b> jetzt die gesamten M&ouml;glichkeiten
                der m&auml;chtigen, objektorientierten Programmiersprache Java zur Verf&uuml;gung. Von einem direkten Einstieg mit
                JavaKarol im Anf&auml;ngerunterricht wird aus didaktischen &Uuml;berlegungen abgeraten (Java ist f&uuml;r eine erste
                Begegnung mit einer Programmiersprache viel zu komplex).<p>
                Die Methoden der Roboter und das Verhalten der Roboter in der Welt wurden aus Robot Karol &uuml;bernommen.
                Dar&uuml;ber hinaus bietet JavaKarol weitere Features (wie zum Beispiel den Einsatz mehrerer Roboter in einer Welt),
                die eine Vertiefung in objektorientierter Modellierung/Programmierung unterst&uuml;tzen.
                <p>
                <hr>
                
                In einer <b>Java-Bibliothek</b> (javakarol.jar) werden die <b>Klassen Roboter</b> und <b>Welt</b> zur
                Verf&uuml;gung gestellt. Die Klasse Welt verwaltet die Objekte, die zur Welt geh&ouml;ren sowie die Darstellung der Welt
                in einem Grafikfenster (JavaKarol Fenster).<p></p>
                <img src="imgs/screen_jkarol.gif" width="419" height="421" border="0"><p>
                &nbsp;<br>
                Beim Neuanlegen eines Objekts der Klasse Welt wird automatisch ein Fenster ge&ouml;ffnet. In der Zeichenfl&auml;che
                des Fensters werden die Objekte dargestellt, die in der Welt enthalten sind (d. h. Marken, Ziegel, Quader und
                Roboter). In manchen Situationen kann der Aufruf einer Robotermethode zu einem Programmabbruch f&uuml;hren
                (z. B. &quot;an die Wand gelaufen&quot;). In diesen F&auml;llen wird im unteren Textfeld des Fensters eine Erkl&auml;rung ausgegeben.
                <p></p>
                Karolwelten als Ausgangssituation f&uuml;r ein Programm k&ouml;nnen durch die Ausf&uuml;hrung mehrerer Robotermethoden
                generiert werden. Das ist aber sehr aufw&auml;ndig. Es wird empfohlen diese Welten mit der
                <a href="progumgebung.htm">Programmierumgebung Robot Karol</a> zu erstellen und als Karolwelt-Dateien (*.kdw)
                zu speichern. Diese Weltdefinitionen k&ouml;nnen dann als Grundlage bei der Erzeugung einer neuen Welt (d.h.
                eines Objekts der Klasse Welt) verwendet werden.
                <br><br>
                </td>
            </tr>
            </table>
        </td>

    </tr>
</table>

</BODY>

</HTML>